{
  "backend/main.mo": "Main Motoko actor for the PHC Nepal health app, defining data types (UserProfile, ANCVisit, GrowthMeasurement, etc.) and canister methods for profile management, page content, pregnancy/ANC tracking, growth monitoring, immunization, community posts, and visitor counting with RBAC authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON file containing one-sentence summaries of five frontend page components: MilestonesPage, SupplementaryFeedingPage, CommunityPage, ProfilePage, and AboutPage.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the PHC Nepal app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing top-level navigation state between main pages and sub-pages, handling authentication via Internet Identity, profile setup modal display, and routing to all feature page components.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown UI component allowing users to switch between English, Hindi, and Nepali languages, highlighting the currently active language.",
  "frontend/src/components/layout/BottomNav.tsx": "Fixed bottom navigation bar with five tabs (Dashboard, Health, Community, Profile, About) that highlights the active tab with a saffron accent.",
  "frontend/src/components/layout/Footer.tsx": "App footer displaying an emergency contact notice, social media links (WhatsApp, Facebook, YouTube), copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky app header component displaying the PHC Nepal logo, app name, a language switcher, and a login/logout button that uses Internet Identity authentication.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time profile setup, collecting name, age, country, role, and conditional due date or child DOB fields, then persisting the profile to the backend.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen loading splash component displaying the PHC Nepal logo and a spinning loader while the app initializes.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider that manages the active language state, persists it to localStorage, and exposes the current translations object via the `useLanguage` hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that wraps DFINITY's AuthClient to manage Internet Identity login/logout state, exposing the identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, pregnancy events, ANC visits, growth measurements, and immunization records.",
  "frontend/src/i18n/config.ts": "Internationalization configuration that imports English, Hindi, and Nepali translations, and provides utilities to get/set the stored language preference from localStorage.",
  "frontend/src/i18n/translations/en.ts": "Complete English translation strings for the entire app, covering navigation, authentication, profile, dashboard, baby planning, and other health module UI text.",
  "frontend/src/i18n/translations/hi.ts": "Complete Hindi translation strings mirroring the English translation structure, covering all app UI text including navigation, auth, profile, dashboard, and health modules.",
  "frontend/src/i18n/translations/ne.ts": "Nepali language translation file containing all UI strings for the PHC Nepal HealthGuide app, covering navigation, authentication, profile, dashboard, and health module content.",
  "frontend/src/index.css": "Global CSS file that imports fonts, configures Tailwind, and defines a custom design token system using OKLCH color variables for an earthy green and saffron palette with light/dark mode support.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query, and an Internet Identity authentication provider.",
  "frontend/src/pages/AboutPage.tsx": "Static about page displaying PHC Nepal's mission, contact details, and social media links (website, email, WhatsApp, Facebook, YouTube) with localized text.",
  "frontend/src/pages/ANCPNCPage.tsx": "Page component for tracking Antenatal Care (ANC) and Postnatal Care (PNC) visits, allowing users to log visit dates and notes with completion status fetched from and saved to the backend.",
  "frontend/src/pages/BabyPlanningPage.tsx": "Informational page presenting baby planning and conception guidance in an accordion layout, covering fertility awareness, conception tips, preconception care, and pregnancy confirmation signs.",
  "frontend/src/pages/CommunityPage.tsx": "Community forum page where authenticated users can create posts categorized by topic (pregnancy, newborn, etc.) and reply to others, with OTP-based verification gating post creation.",
  "frontend/src/pages/DangerSignsPage.tsx": "Displays danger signs for pregnancy, labor, postnatal, and newborn stages with color-coded cards, plus emergency contact buttons for phone and WhatsApp.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing the user's current health stage (planning/trimester/child age) with a progress bar and a grid of navigation cards for all health modules.",
  "frontend/src/pages/GrowthMonitoringPage.tsx": "Growth monitoring page that lets users log child measurements (weight, height, head circumference) and visualizes them over time using a Recharts line chart.",
  "frontend/src/pages/HealthModulesPage.tsx": "A navigable list of all health module cards (baby planning, pregnancy, ANC/PNC, etc.) that routes to the corresponding module page on tap.",
  "frontend/src/pages/ImmunizationPage.tsx": "Immunization tracker that displays the child's vaccine schedule with due dates, overdue indicators, and allows users to mark vaccines as completed with a given date.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with a hero banner, app branding, and an Internet Identity-powered Google login button, along with a security notice and feature highlights.",
  "frontend/src/pages/MilestonesPage.tsx": "Displays child development milestones organized by age band and domain (physical, cognitive, language, social) using accordion and tabs, with a separate tab for common problems.",
  "frontend/src/pages/NewbornCarePage.tsx": "Shows newborn care guidance across accordion sections covering immediate care steps, colostrum benefits, and breastfeeding information with localized content.",
  "frontend/src/pages/NutritionPage.tsx": "Presents nutrition advice for different pregnancy and breastfeeding stages via tabs, plus a hygiene tips tab, all driven by localized translation data.",
  "frontend/src/pages/PregnancyTrackingPage.tsx": "Tracks pregnancy by displaying gestational age, trimester, and EDD from the user profile, and allows logging new pregnancy events via a form backed by canister queries.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and allows editing of the user's profile (name, age, role, due date, child DOB) with role-conditional fields, saving changes to the backend via a mutation hook.",
  "frontend/src/pages/SupplementaryFeedingPage.tsx": "React page component displaying supplementary feeding guidelines by age band and family planning methods in a tabbed layout, with multilingual support via LanguageContext.",
  "frontend/src/utils/pregnancyCalculations.ts": "Utility functions for calculating gestational age from EDD, trimester from weeks, child age from DOB, and converting between date formats and nanosecond timestamps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Nunito, Noto Sans Devanagari), oklch-based color tokens for the PHC Nepal palette (greens, saffron, cream), and plugin imports for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the PHC Nepal maternal and child health app's architecture, trilingual PWA requirements, pending feature requests (AR-1 through AR-11+), and known build issues."
}